// CHlab2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <ctime>
#include "ClassMartix.h"
using namespace std;

int main()
{
    srand(time(0));
    int N = 8, L = 3;
    /*
    ClassMatrix A(N, L);
    cout << "##### Vectors ######\n";
    A.print_class_matrix_vectors();
    cout << "%%%%%%%% MATRIX %%%%%%%\n";
    A.print_class_matrix();
    cout << "\n";
    A.solve_ext();*/

    for (int i = 1; i <= 10; i++) {
        ClassMatrix b(N, L);
        b.solve_ext();
    }
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
